The terraform plan output:
```
Terraform will perform the following actions:

  # module.api_service.module.postgres.aws_db_parameter_group.default[0] must be replaced
+/- resource "aws_db_parameter_group" "default" {
      ~ arn         = "arn:aws:rds:us-west-2:xxxxxxxxxx:pg:api-db-20220331153311430500000002" -> (known after apply)
      ~ family      = "aurora-postgresql11" -> "aurora-postgresql12" # forces replacement
      ~ id          = "api-db-20220331153311430500000002" -> (known after apply)
      ~ name        = "api-db-20220331153311430500000002" -> (known after apply)
        tags        = {
            "Name" = "api-db"
        }
        # (3 unchanged attributes hidden)
    }

  # module.api_service.module.postgres.aws_rds_cluster.primary[0] will be updated in-place
  ~ resource "aws_rds_cluster" "primary" {
      ~ allow_major_version_upgrade         = false -> true
      ~ db_cluster_parameter_group_name     = "api-db-20220331153311419900000001" -> (known after apply)
      + enable_global_write_forwarding      = false
      ~ engine_version                      = "11.13" -> "12.9"
        id                                  = "api-db"
        tags                                = {
            "Name" = "api-db"
        }
        # (33 unchanged attributes hidden)
    }

  # module.api_service.module.postgres.aws_rds_cluster_instance.default[0] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "default" {
      + apply_immediately                     = true
      ~ db_parameter_group_name               = "api-db-20220331153311430500000002" -> (known after apply)
        id                                    = "api-db-1"
      ~ instance_class                        = "db.t3.large" -> "db.t3.medium"
      ~ preferred_maintenance_window          = "wed:13:04-wed:13:34" -> "wed:03:00-wed:04:00"
        tags                                  = {
            "Name" = "api-db"
        }
        # (24 unchanged attributes hidden)
    }

  # module.api_service.module.postgres.aws_rds_cluster_parameter_group.default[0] must be replaced
+/- resource "aws_rds_cluster_parameter_group" "default" {
      ~ arn         = "arn:aws:rds:us-west-2:xxxxxxxxxxx:cluster-pg:api-db-20220331153311419900000001" -> (known after apply)
      ~ family      = "aurora-postgresql11" -> "aurora-postgresql12" # forces replacement
      ~ id          = "api-db-20220331153311419900000001" -> (known after apply)
      ~ name        = "api-db-20220331153311419900000001" -> (known after apply)
        tags        = {
            "Name" = "api-db"
        }
        # (3 unchanged attributes hidden)
    }
```

After yes to applying the changes:
```
module.api_service.module.postgres.aws_db_parameter_group.default[0]: Creating...
module.api_service.module.postgres.aws_rds_cluster_parameter_group.default[0]: Creating...
module.api_service.module.postgres.aws_db_parameter_group.default[0]: Creation complete after 1s [id=api-db-20220331162335693200000001]
module.api_service.module.postgres.aws_rds_cluster_parameter_group.default[0]: Creation complete after 1s [id=api-db-20220331162335693200000002]
module.api_service.module.postgres.aws_rds_cluster.primary[0]: Modifying... [id=api-db]
```

And then the error:
```
Error: Failed to modify RDS Cluster (api-db): InvalidParameterCombination: The current DB instance parameter group api-db-20220331153311430500000002 is custom. You must explicitly specify a new DB instance parameter group, either default or custom, for the engine version upgrade.
```